       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN-PROG.
       PROCEDURE DIVISION.
           CALL "SUB-PROG".
           STOP RUN.
       END PROGRAM MAIN-PROG.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUB-PROG.
       PROCEDURE DIVISION.
           DISPLAY "PASS".
           EXIT PROGRAM.
       END PROGRAM SUB-PROG.
