       IDENTIFICATION DIVISION.
       PROGRAM-ID. SMOKE-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RESULT PIC X(20) VALUE SPACES.
       01 WS-PTR PIC 9(2) VALUE 1.
       PROCEDURE DIVISION.
           STRING "HELLO" DELIMITED BY SIZE
                  " "     DELIMITED BY SIZE
                  "COBOL" DELIMITED BY SIZE
             INTO WS-RESULT
             WITH POINTER WS-PTR.
           DISPLAY WS-RESULT.
           STOP RUN.
