       IDENTIFICATION DIVISION.
       PROGRAM-ID. SMOKE-DECIMAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT PIC 9(5)V99 VALUE 5000.00.
       01 WS-DIVISOR PIC 9(1) VALUE 6.
       01 WS-RESULT PIC 9(5).9(2) VALUE ZEROS.
       PROCEDURE DIVISION.
           DIVIDE WS-AMOUNT BY WS-DIVISOR
             GIVING WS-RESULT ROUNDED.
           DISPLAY WS-RESULT.
           STOP RUN.
