       IDENTIFICATION DIVISION.
       PROGRAM-ID. SMOKE-SUB.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-RESULT PIC 9(4).
       PROCEDURE DIVISION USING LS-RESULT.
           MOVE 42 TO LS-RESULT.
           EXIT PROGRAM.
