      *IC218A-SUB - SUB-PROGRAM FOR BY REFERENCE/CONTENT TEST
       IDENTIFICATION DIVISION.
       PROGRAM-ID. IC218A-SUB.
       DATA DIVISION.
       LINKAGE SECTION.
       01  LS-PARAM1             PIC X(10).
       01  LS-PARAM2             PIC X(10).
       PROCEDURE DIVISION USING LS-PARAM1
                                 LS-PARAM2.
       IC218A-SUB-MAIN.
      *    MODIFY BOTH PARAMS - ONLY REFERENCE SHOULD PERSIST
           MOVE "MODIFIED" TO LS-PARAM1.
           MOVE "CHANGED" TO LS-PARAM2.
           GOBACK.
