      *IC217A-SUB - SUB-PROGRAM FOR ADD AND RETURN VIA USING
       IDENTIFICATION DIVISION.
       PROGRAM-ID. IC217A-SUB.
       DATA DIVISION.
       LINKAGE SECTION.
       01  LS-INPUT-A            PIC 9(4).
       01  LS-INPUT-B            PIC 9(4).
       01  LS-RESULT             PIC 9(8).
       PROCEDURE DIVISION USING LS-INPUT-A LS-INPUT-B
           LS-RESULT.
       IC217A-SUB-MAIN.
           ADD LS-INPUT-A TO LS-INPUT-B GIVING LS-RESULT.
           GOBACK.
