      *IC220A-SUB - SUB-PROGRAM FOR NUMERIC PARAMETER TYPES TEST
       IDENTIFICATION DIVISION.
       PROGRAM-ID. IC220A-SUB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-CONSTANT           PIC 9(4) VALUE 100.
       LINKAGE SECTION.
       01  LS-INPUT-NUM          PIC 9(6).
       01  LS-OUTPUT-NUM         PIC 9(8).
       PROCEDURE DIVISION USING LS-INPUT-NUM
                                 LS-OUTPUT-NUM.
       IC220A-SUB-MAIN.
           ADD LS-INPUT-NUM TO WS-CONSTANT
               GIVING LS-OUTPUT-NUM
           END-ADD
           GOBACK.
