       01 XX-FIRST PIC X(8) VALUE "LEAD-OK ".
       01 XX-SECOND PIC X(8) VALUE "LEAD-TWO".
       01 ITEM-YY PIC X(8) VALUE "TRAIL-OK".
       01 COUNT-YY PIC 9(4) VALUE 7777.
