       01 :P:-FIRST PIC X(8) VALUE :V1:.
       01 :P:-SECOND PIC 9(4) VALUE :V2:.
       01 :P:-THIRD PIC X(5) VALUE :V3:.
       01 :P:-FOURTH PIC 9(6) VALUE :V4:.
