       01 :OUT:-VAL PIC X(8) VALUE :OUT-LIT:.
       COPY SM210A-INNER REPLACING ==:INR:== BY ==SM210A==
                                    ==:INR-LIT:== BY =="INNER   "==
                                    ==:INR-NUM:== BY ==4321==.
